Sirokujira/llvm/lib/Target/RX600/Disassembler/RX600Disassembler.cpp
//===- RX600Disassembler.cpp - Disassembler for RX600 -------------*- C++ -*-===//
//
//                     The LLVM Compiler Infrastructure
//
// This file is distributed under the University of Illinois Open Source
// License. See LICENSE.TXT for details.
//
//===----------------------------------------------------------------------===//
//
// This file is part of the RX600 Disassembler.
//
//===----------------------------------------------------------------------===//

#include "RX600.h"
#include "RX600Subtarget.h"
#include "llvm/MC/EDInstInfo.h"
#include "llvm/MC/MCDisassembler.h"
#include "llvm/MC/MCFixedLenDisassembler.h"
#include "llvm/Support/MemoryObject.h"
#include "llvm/Support/TargetRegistry.h"
#include "llvm/MC/MCSubtargetInfo.h"
#include "llvm/MC/MCInst.h"
#include "llvm/MC/MCRegisterInfo.h"
#include "llvm/Support/MathExtras.h"

#include "RX600GenEDInfo.inc"

using namespace llvm;

typedef MCDisassembler::DecodeStatus DecodeStatus;

/// RX600Disassembler - a disasembler class for RX600.
class RX600Disassembler : public MCDisassembler {
public:
  /// Constructor     - Initializes the disassembler.
  ///
  RX600Disassembler(const MCSubtargetInfo &STI)
      : MCDisassembler(STI) {}

  ~RX600Disassembler() {}

  /// getInstruction - See MCDisassembler.
  DecodeStatus getInstruction(MCInst &instr,
                              uint64_t &size,
                              const MemoryObject &region,
                              uint64_t address,
                              raw_ostream &vStream,
                              raw_ostream &cStream) const;

  const EDInstInfo *getEDInfo() const;

private:
  DecodeStatus readInstruction32(const MemoryObject &region,
                                 uint64_t address,
                                 uint64_t &size,
                                 uint32_t &insn) const;
};

const EDInstInfo *RX600Disassembler::getEDInfo() const {
  return instInfoRX600;
}

// Decoder tables for RX600 register
// Base : RISC-V 設定
// https://en.wikichip.org/wiki/risc-v/registers : Calling convention
/*
static const unsigned CPURegsTable[] = {
  RX600::ZERO, 	// x0 : zero  hardwired zero  
  RX600::V0,	// ???
  RX600::A0, 	// x10-11	function arguments / return values
  RX600::A1, 	// x10-11	function arguments / return values
  RX600::A2,	// x12-17	function arguments 
  RX600::A3,	// x12-17	function arguments 
  RX600::T0, 	// x5-7 temporary registers 
  RX600::T1, 	// x5-7 temporary registers 
  RX600::T2, 	// x5-7 temporary registers 
  RX600::T3,	// t3-6 temporary registers  
  RX600::S0,	// s0 / fp  saved register / frame pointer  
  RX600::S1,	// x9    saved register
  RX600::S2,	// x18-27    saved registers
  RX600::S3,	// x18-27    saved registers
  RX600::SP,	// x2  stack pointer
  RX600::RA		// x1  return address
};
*/
// CPU レジスタセットを見て対応?
// Arm 側のソースコードの対応も見ておいた方がよい?(レジスタの切り替えの点から)
// https://www.renesas.com/jp/ja/doc/products/mpumcu/doc/rx_family/r01us0032jj0120_rxsm.pdf
static const unsigned CPURegsTable[] = {
  RX600::ZERO, RX600::V0,
  RX600::A0, RX600::A1, RX600::A2, RX600::A3,
  RX600::T0, RX600::T1, RX600::T2, RX600::T3,
  RX600::S0, RX600::S1, RX600::S2, RX600::S3,
  RX600::SP, RX600::RA
};


// Forward declare these because the autogenerated code will reference them.
// Definitions are further down.
// DecodeXXX関数はtablegenでDecoderMethodを指定した場合に
// decodeRX600Instruction32()から参照される。

// tablegenで作成したCPURegs(RegisterClass)を表示する
static DecodeStatus DecodeCPURegsRegisterClass(MCInst &Inst,
                                               unsigned RegNo,
                                               uint64_t Address,
                                               const void *Decoder);
static DecodeStatus DecodeMem(MCInst &Inst,
                              unsigned RegNo,
                              uint64_t Address,
                              const void *Decoder);

static DecodeStatus DecodeMoveTarget(MCInst &Inst,
                                     unsigned Insn,
                                     uint64_t Address,
                                     const void *Decoder);

static DecodeStatus DecodeCallTarget(MCInst &Inst,
                                     unsigned Insn,
                                     uint64_t Address,
                                     const void *Decoder);

static MCDisassembler *createRX600Disassembler(
                       const Target &T,
                       const MCSubtargetInfo &STI) {
  return new RX600Disassembler(STI);
}

extern "C" void LLVMInitializeRX600Disassembler() {
  // Register the disassembler.
  TargetRegistry::RegisterMCDisassembler(TheRX600Target,
                                         createRX600Disassembler);
}

#include "RX600GenDisassemblerTables.inc"

  /// readInstruction - read four bytes from the MemoryObject
  /// and return 32 bit word sorted according to the given endianess
DecodeStatus RX600Disassembler::
readInstruction32(const MemoryObject &region,
                  uint64_t address,
                  uint64_t &size,
                  uint32_t &insn) const {
  uint8_t Bytes[4];

  // We want to read exactly 4 Bytes of data.
  if (region.readBytes(address, 4, (uint8_t*)Bytes, NULL) == -1) {
    size = 0;
    return MCDisassembler::Fail;
  }

  // Encoded as a small-endian 32-bit word in the stream.
  insn = (Bytes[3] <<  0) |
         (Bytes[2] <<  8) |
         (Bytes[1] << 16) |
         (Bytes[0] << 24);

  return MCDisassembler::Success;
}

DecodeStatus RX600Disassembler::
getInstruction(MCInst &instr,
               uint64_t &Size,
               const MemoryObject &Region,
               uint64_t Address,
               raw_ostream &vStream,
               raw_ostream &cStream) const {
  uint32_t Insn;

  DecodeStatus Result = readInstruction32(Region, Address, Size,
                                          Insn);
  if (Result == MCDisassembler::Fail)
    return MCDisassembler::Fail;

  // Calling the auto-generated decoder function.
  Result = decodeInstruction(DecoderTableRX600, 
                             instr, Insn, Address, this, STI);
  if (Result != MCDisassembler::Fail) {
    Size = 4;
    return Result;
  }

  return MCDisassembler::Fail;
}

static DecodeStatus DecodeCPURegsRegisterClass(MCInst &Inst,
                                               unsigned RegNo,
                                               uint64_t Address,
                                               const void *Decoder) {
  if (RegNo > 31)
    return MCDisassembler::Fail;

  Inst.addOperand(MCOperand::CreateReg(CPURegsTable[RegNo]));
  return MCDisassembler::Success;
}

static DecodeStatus DecodeMem(MCInst &Inst,
                              unsigned Insn,
                              uint64_t Address,
                              const void *Decoder) {
  int Offset = SignExtend32<16>(Insn & 0xffff);
  int Reg = (int)fieldFromInstruction(Insn, 16, 4);
  int Base = (int)fieldFromInstruction(Insn, 20, 4);

  Inst.addOperand(MCOperand::CreateReg(CPURegsTable[Reg]));
  Inst.addOperand(MCOperand::CreateReg(CPURegsTable[Base]));
  Inst.addOperand(MCOperand::CreateImm(Offset));

  return MCDisassembler::Success;
}

static DecodeStatus DecodeMoveTarget(MCInst &Inst,
                                     unsigned Insn,
                                     uint64_t Address,
                                     const void *Decoder) {
  int Offset = SignExtend32<20>(Insn & 0xfffff);
  int Reg = (int)fieldFromInstruction(Insn, 20, 4);

  Inst.addOperand(MCOperand::CreateReg(CPURegsTable[Reg]));
  Inst.addOperand(MCOperand::CreateImm(Offset));

  return MCDisassembler::Success;
}

static DecodeStatus DecodeCallTarget(MCInst &Inst,
                                     unsigned Insn,
                                     uint64_t Address,
                                     const void *Decoder) {

  unsigned CallOffset = fieldFromInstruction(Insn, 0, 24) << 2;
  Inst.addOperand(MCOperand::CreateImm(CallOffset));
  return MCDisassembler::Success;
}
